niklasonfire/wildfire-monitor/sdkconfig.defaults
# --- Target: M5StickC PLUS2 (ESP32-PICO-V3-02, 8 MB flash, 2 MB PSRAM) ---
CONFIG_IDF_TARGET="esp32"

# Flash: 8 MB in-package, DIO @ 80 MHz (matches M5 factory config)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- OTA: two app slots, and the bootloader's rollback (ADR-0006) ---
# The Monitor is mounted on a vehicle, so a firmware that will not boot must
# not be a firmware that has to come off the bike. With rollback enabled a
# freshly written image boots on probation and keeps its place only by calling
# esp_ota_mark_app_valid_cancel_rollback(); a crash loop, a hang, or a health
# check that never passes and the next reset takes the bootloader back to the
# slot that worked. What the image has to prove first is in main/ota_health.c.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Console on UART0 (GPIO1/GPIO3 -> CH9102 USB-serial), 115200 baud
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth: NimBLE, BLE only, central role ---
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
# Two links so the Fardriver controller and the Daly BMS can be held at once.
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# --- Capture store: FAT with wear levelling on the "storage" partition ---
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=64
CONFIG_FATFS_SECTOR_4096=y

# --- Wi-Fi: only ever up in readout mode, so keep it small ---
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# --- Standalone capture runs unattended: reboot rather than hang ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_INT_WDT_TIMEOUT_MS=800

# --- IRAM: Wi-Fi and NimBLE are both linked in, and their IRAM-resident ISRs
# together overflow the 128 KB segment. Neither runs while the other does, and
# none of this is on a latency-critical path, so push what can be pushed back
# into flash and build for size rather than for a debugger.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=n
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=n
CONFIG_SPI_SLAVE_ISR_IN_IRAM=n
